W5D2/reddit_app/app/models/user.rb

  def reset_session_token
    self.session_token = self.class.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "uQVQdqciT3tYGAPd3NRgaw"], ["updated_at", "2019-09-10 20:14:30.903872"], ["id", 1]]