W5D2/reddit_app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "sub_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.sub_id = params[:sub_id]
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1 WHERE "posts"."id" = $2  [["content", "Lock cat out in the rain, throw soap."], ["id", 1]]
---
  def update
    @post = current_user.posts.find_by(id: params[:id])
    if @post
      if @post.update_attributes(post_params)