W4D2/ninety_nine_cats/app/controllers/cats_controller.rb

  def create
    cat = Cat.new(cat_params)
    if cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Whatevs"], ["updated_at", "2019-09-03 20:00:45.103855"], ["id", 1]]